app/Services/AuthService.php

    public function login(string $email, string $password): array
    {
        // 1. Vérifier les credentials
        $user = User::where('email', $email)->first();
---
select * from "users" where "email" = 'admin@banque.sn' limit 1