app/Services/CompteService.php

    private function fetchComptes(array $filters, ?User $user = null)
    {
        $query = Compte::with(['client.user'])
            ->whereNull('archived_at')
            ->where('statut', 'actif');

        // Autorisation : Client voit uniquement ses comptes
        if ($user && $user->role === 'client') {
            // Récupérer le client_id de l'utilisateur
            $client = $user->client;
            if ($client) {
                $query->where('client_id', $client->id);
            } else {
                // Si l'utilisateur n'a pas de client associé, retourner vide
                $query->whereRaw('1 = 0'); // Aucun résultat
            }
        }
        // Admin voit tous les comptes (pas de filtre supplémentaire)

        $query = $this->applyFilters($query, $filters);

        return $query->paginate($filters['limit'] ?? 10);
---
select * from "comptes" where "archived_at" is null and "statut" = 'actif' and "comptes"."deleted_at" is null order by "dateCreation" desc limit 10 offset 0
select * from "clients" where "clients"."id" in ('a0344983-aa63-44ee-b10c-e73f9d46a2d2', 'a035d13e-4876-46b1-83a9-974725985ef5', 'a03692fd-11a1-47be-8675-43cc2dd8cc62', 'a0369496-e937-4e7a-a453-a279d035459d', 'a0369539-b6df-4dd8-a009-3f747f6f827f', 'a036b418-3afa-4741-9dd1-645c5e7b6e98', 'a036b50f-8bd9-457d-9263-015f0ab8f3a4', 'a036bdc3-7658-40a0-a9ba-a5f7f71dff00', 'a036c22a-073f-4b4b-9e64-2f96ade97849', 'a03747b4-70ef-4861-bc89-17ea9bd8adb6')
select * from "users" where "users"."id" in ('a0344982-baac-4220-8898-2de7be475bc6', 'a035d13d-2bdd-472e-8483-e52b01caba8a', 'a03692fc-ed9c-45d0-85a2-0a2fe12809bd', 'a0369496-c8c8-4457-8a5a-1570ee1bdbfb', 'a0369539-958e-4faa-a139-e126d90b3497', 'a036b418-159b-487b-a38c-90c5dee0414d', 'a036b50f-6de3-467e-b093-1716053ab1c4', 'a036bdc3-536f-42c0-9a6e-a89123de9836', 'a036c229-db8b-4ff8-80b6-c73f57b687fa', 'a03747b4-34ca-45f9-9d49-618b0cb99fb8')
select count(*) as aggregate from "comptes" where "archived_at" is null and "statut" = 'actif' and "comptes"."deleted_at" is null

    public function getCompteById(string $id, User $user): array
    {
        // 1. Chercher d'abord dans la base principale (PostgreSQL) - comptes actifs
        $compte = Compte::where('id', $id)
            ->where('statut', 'actif')
            ->with(['client.user'])
            ->first();
---
select * from "clients" where "clients"."id" in ('a03747b4-70ef-4861-bc89-17ea9bd8adb6')
select * from "comptes" where "id" = 'a03747b4-b6cf-4216-878f-a250ddf44a6a' and "statut" = 'actif' and "comptes"."deleted_at" is null limit 1
select * from "users" where "users"."id" in ('a03747b4-34ca-45f9-9d49-618b0cb99fb8')

        }

        // 2. Si non trouvé dans PostgreSQL, chercher dans les archives Neon
        $archivedCompte = DB::connection('neon')
            ->table('archives_comptes')
            ->where('id', $id)
            ->first();
---
select * from "archives_comptes" where "id" = 'a035812c-50d6-431f-82f6-a414efa39899' limit 1

    public function bloquerCompte(string $compteId, array $data): array
    {
        DB::beginTransaction();

        try {
            // 1. Récupérer le compte
            $compte = Compte::find($compteId);
---
select * from "comptes" where "comptes"."id" = 'a036be83-3934-4d12-a5a5-64154ebccaa2' and "comptes"."deleted_at" is null limit 1