app/Services/CompteService.php

    private function fetchComptes(array $filters, ?User $user = null)
    {
        $query = Compte::with(['client.user'])
            ->whereNull('archived_at')
            ->where('statut', 'actif');

        // Autorisation : Client voit uniquement ses comptes
        if ($user && $user->role === 'client') {
            // Récupérer le client_id de l'utilisateur
            $client = $user->client;
            if ($client) {
                $query->where('client_id', $client->id);
            } else {
                // Si l'utilisateur n'a pas de client associé, retourner vide
                $query->whereRaw('1 = 0'); // Aucun résultat
            }
        }
        // Admin voit tous les comptes (pas de filtre supplémentaire)

        $query = $this->applyFilters($query, $filters);

        return $query->paginate($filters['limit'] ?? 10);
---
select * from "clients" where "clients"."id" in ('a0344983-aa63-44ee-b10c-e73f9d46a2d2', 'a036bdc3-7658-40a0-a9ba-a5f7f71dff00', 'a036c22a-073f-4b4b-9e64-2f96ade97849', 'a03747b4-70ef-4861-bc89-17ea9bd8adb6', 'a0381f64-db6e-48c5-933a-83a4a9f0328f')
select * from "users" where "users"."id" in ('a0344982-baac-4220-8898-2de7be475bc6', 'a036bdc3-536f-42c0-9a6e-a89123de9836', 'a036c229-db8b-4ff8-80b6-c73f57b687fa', 'a03747b4-34ca-45f9-9d49-618b0cb99fb8', 'a0381f64-ba42-40f8-8787-478662dbd2cc')
select * from "comptes" where "archived_at" is null and "statut" = 'actif' and "client_id" = 'a034497c-04fd-4a29-85db-197bcc2e9181' and "comptes"."deleted_at" is null order by "dateCreation" desc limit 10 offset 0
select * from "clients" where "clients"."id" in ('a034497c-04fd-4a29-85db-197bcc2e9181')
select * from "users" where "users"."id" in ('a034487f-c105-4c26-8568-3ce796dcd57b')
select count(*) as aggregate from "comptes" where "archived_at" is null and "statut" = 'actif' and "client_id" = 'a034497c-04fd-4a29-85db-197bcc2e9181' and "comptes"."deleted_at" is null