app/Services/CompteArchiveService.php

    public function archiveCompte(Compte $compte, ?User $user = null, ?string $reason = null): CompteArchive
    {
        try {
            DB::beginTransaction();

            // 1. Vérifier que le compte peut être archivé (fermé, bloqué, ou épargne)
            // Note : Tous les comptes fermés/bloqués sont archivés automatiquement

            // 2. Charger les relations nécessaires
            $compte->load('client.user');
---
select * from "clients" where "clients"."id" in ('a035d836-d64e-439e-b997-16dffd01552b')
select * from "users" where "users"."id" in ('a035d835-baf1-4a66-93ca-66f657f72c81')

            ]);

            // 4. Marquer le compte comme archivé dans la base principale
            $compte->update([
                'archived_at' => now(),
                'cloud_storage_path' => "neon://comptes_archives/{$compte->id}",
            ]);
---
update "comptes" set "statut" = 'bloque', "motifBlocage" = 'Suspicion dactivité frauduleuse détectée sur ce compte', "version" = 4, "archived_at" = '2025-10-27 10:28:25', "cloud_storage_path" = 'neon://comptes_archives/a035812c-50d6-431f-82f6-a414efa39899', "derniereModification" = '2025-10-27 10:28:18' where "id" = 'a035812c-50d6-431f-82f6-a414efa39899'