app/Http/Controllers/Api/V1/CompteController.php

    public function showByNumero(string $numero): JsonResponse
    {
        try {
            // 1. Chercher d'abord dans la base principale (Render) - comptes actifs uniquement
            $compte = Compte::where('numeroCompte', $numero)
                ->whereNull('archived_at')
                ->where('statut', 'actif')
                ->with(['client.user'])
                ->first();
---
select * from "clients" where "clients"."id" in ('a0355ee9-699c-4104-85bc-05926c2df966')
select * from "comptes" where "numeroCompte" = 'TEST_CQ_ACTIF' and "archived_at" is null and "statut" = 'actif' and "comptes"."deleted_at" is null limit 1
select * from "users" where "users"."id" in ('a0355ee6-ea6e-4a9f-af15-a667bdfee03b')