app/Http/Controllers/Api/V1/CompteController.php

select * from "clients" where "clients"."id" in ('a03465a4-757d-4c2b-8391-6979d74c46fa')
select * from "users" where "users"."id" in ('a03465a3-555c-4768-a233-5794dc048143')
---
    public function showByNumero(string $numero): JsonResponse
    {
        try {
            // 1. Chercher d'abord dans la base principale (Render) - comptes actifs uniquement
            $compte = Compte::where('numeroCompte', $numero)
                ->whereNull('archived_at')
                ->where('statut', 'actif')
                ->with(['client.user'])
                ->first();