app/Models/Compte.php

    protected static function generateNumeroCompte(): string
    {
        do {
            // Format: CPXXXXXXXXXX (CP + 10 chiffres aléatoires)
            $numero = 'CP' . str_pad(mt_rand(0, 9999999999), 10, '0', STR_PAD_LEFT);
        } while (self::where('numeroCompte', $numero)->exists());
---
select exists(select * from "comptes" where "numeroCompte" = 'CP6944203087' and "comptes"."deleted_at" is null and "deleted_at" is null) as "exists"

    public function getSoldeAttribute(): float
    {
        $depots = $this->transactions()
            ->where('type', 'depot')
            ->where('statut', 'validee')
            ->sum('montant');
---
select sum("montant") as aggregate from "transactions" where "transactions"."compte_id" = 'a035d4fd-41b6-4047-8214-f1af96fdc1b0' and "transactions"."compte_id" is not null and "type" = 'retrait' and "statut" = 'validee'