app/Repositories/CompteRepository.php

select * from "clients" where "clients"."id" in ('a035d836-d64e-439e-b997-16dffd01552b')
select * from "users" where "users"."id" in ('a035d835-baf1-4a66-93ca-66f657f72c81')
---
    public function findByNumero(string $numero): ?Compte
    {
        return $this->model->with('client.user')->numero($numero)->first();

insert into "archives_comptes" ("id", "numeroCompte", "client_id", "type", "solde", "devise", "statut", "dateFermeture", "created_at", "updated_at") values ('a035d839-2e9e-4aed-886e-2398a1ffd2f0', 'CP3162783468', 'a035d836-d64e-439e-b997-16dffd01552b', 'epargne', 0, 'FCFA', 'ferme', '2025-10-27 09:15:18', '2025-10-27 09:15:18', '2025-10-27 09:15:18')
update "comptes" set "statut" = 'ferme', "version" = 3, "derniereModification" = '2025-10-27 09:15:22' where "id" = 'a035d839-2e9e-4aed-886e-2398a1ffd2f0'
---
    public function deleteAndArchive(Compte $compte): bool
    {
        DB::transaction(function () use ($compte) {
            // Calculer le solde actuel
            $solde = $compte->solde;

            // Archiver dans Neon avec toutes les informations nécessaires
            DB::connection('neon')->table('archives_comptes')->insert([
                'id' => $compte->id,
                'numeroCompte' => $compte->numeroCompte,
                'client_id' => $compte->client_id,
                'type' => $compte->type,
                'solde' => $solde,
                'devise' => $compte->devise ?? 'FCFA',
                'statut' => 'ferme',
                'dateFermeture' => now(),
                'created_at' => now(),
                'updated_at' => now(),
            ]);

            // Mettre le statut à 'ferme' avant le soft delete
            $compte->update(['statut' => 'ferme']);

select * from "comptes" where "comptes"."id" = 'a035df85-e242-45c8-9d4b-88f4a2c94ae4' limit 1
select * from "archives_comptes" where "id" = 'a035d839-2e9e-4aed-886e-2398a1ffd2f0' limit 1
select * from "clients" where "clients"."id" in ('a035d13e-4876-46b1-83a9-974725985ef5')
select * from "users" where "users"."id" in ('a035d13d-2bdd-472e-8483-e52b01caba8a')
insert into "comptes" ("devise", "statut", "version", "numeroCompte", "type", "client_id", "id", "derniereModification", "dateCreation") values ('FCFA', 'actif', 1, 'CP5091523552', 'cheque', 'a035d13e-4876-46b1-83a9-974725985ef5', 'a0367188-21dd-4f37-9d55-c5cf90850058', '2025-10-27 09:22:14', '2025-10-27 09:22:14')
delete from "archives_comptes" where "id" = 'a035d140-7bf1-45cd-b5dd-5401faeda695'
select * from "comptes" where "id" = 'a0367188-21dd-4f37-9d55-c5cf90850058' limit 1
---
    public function restore(string $id): ?Compte
    {
        // Récupérer le compte depuis l'archive Neon
        $archivedCompte = DB::connection('neon')
            ->table('archives_comptes')
            ->where('id', $id)
            ->first();

        if (!$archivedCompte) {
            return null;
        }

        return DB::transaction(function () use ($archivedCompte) {
            // Recréer le compte dans PostgreSQL
            $compte = $this->model->create([
                'id' => $archivedCompte->id,
                'numeroCompte' => $archivedCompte->numeroCompte,
                'type' => $archivedCompte->type,
                'client_id' => $archivedCompte->client_id,
                'statut' => 'actif', // Réactivé
                'devise' => $archivedCompte->devise ?? 'FCFA',
            ]);

            // Supprimer de l'archive Neon
            DB::connection('neon')->table('archives_comptes')
                ->where('id', $archivedCompte->id)
                ->delete();

            return $compte->fresh(['client.user']);
        });

select "id", "numeroCompte", "client_id", "type", "solde", "devise", "statut", "dateFermeture", "created_at", "updated_at" from "archives_comptes" order by "dateFermeture" desc limit 10 offset 0
select count(*) as aggregate from "archives_comptes"
---
    public function getArchived(int $perPage = 10): LengthAwarePaginator
    {
        // Forcer la reconnexion pour éviter les problèmes de cache de plan
        DB::connection('neon')->reconnect();

        return DB::connection('neon')
            ->table('archives_comptes')
            ->select('id', 'numeroCompte', 'client_id', 'type', 'solde', 'devise', 'statut', 'dateFermeture', 'created_at', 'updated_at')
            ->orderBy('dateFermeture', 'desc')
            ->paginate($perPage);